# The script of the game goes in this file.

# Declare characters used by this game. The color argument colorizes the
# name of the character.

define Player  =    Character("[Player]")
define Bell    =    Character("เบล")
define Kai     =    Character("กาย")
define Fah     =    Character("ฟ้า")
define Yuri    =    Character("ยูริ")
define Unknown =    Character("บุคคลปริศนา")

define Npc     =    Character("ผู้ร่วมแข่งขันคนอื่นๆ")
define Mc      =    Character("เจ้าหน้าที่")



 #ค่าคะแนนด่าน1
define Player_Score1 = 0 #คะแนนตัวผู้เล่น
define Bell_Score1   = 0 #คะแนนเบล
define Kai_Score1    = 0 #คะแนนผู้เล่นกา
#ผู้เล่นไม่มีบท มีทั้งหมด 15 คน
define NPC1_Score   = 0 #ตัวละครอื่นตัวที่ 1
define NPC2_Score   = 0 #ตัวละครอื่นตัวที่ 2
define NPC3_Score   = 0 #ตัวละครอื่นตัวที่ 3
define NPC4_Score   = 0 #ตัวละครอื่นตัวที่ 4
define NPC5_Score   = 0 #ตัวละครอื่นตัวที่ 5
define NPC6_Score   = 0 #ตัวละครอื่นตัวที่ 6
define NPC7_Score   = 0 #ตัวละครอื่นตัวที่ 7
define NPC8_Score   = 0 #ตัวละครอื่นตัวที่ 8
define NPC9_Score   = 0 #ตัวละครอื่นตัวที่ 9
define NPC10_Score   = 0 #ตัวละครอื่นตัวที่ 10
define NPC11_Score   = 0 #ตัวละครอื่นตัวที่ 11
define NPC12_Score   = 0 #ตัวละครอื่นตัวที่ 12
define NPC13_Score   = 0 #ตัวละครอื่นตัวที่ 13



#ค่าคะแนนด่าน 2
define Player_Score2 = 0 #คะแนนตัวผู้เล่น
define Bell_Score2   = 0 #คะแนนเบล
define Kai_Score2    = 0 #คะแนนผู้เล่นกา


#ค่าตัวละคร Player 
define Currently_Score = 0
#ค่าตัวละคร Bell
define B_Relation = 5 #ค่าความสัมพันธ์
define B_Intelligent = 0 #ต่าความฉลา
#ค่าตัวละคร Kai
define K_Relation    = 5 #ค่าความสัมพันธ์
# The game starts here.

screen Bell:
    imagebutton:
        xalign 0.5 yalign 0.5 
        

        idle "bell_a.png"

screen Kai:
    imagebutton:
        xalign 0.5 yalign 0.5 
        

        idle "kai_a.png"

screen Fah:
    imagebutton:
        xalign 0.5 yalign 0.5 
        

        idle "fah_a.png"

screen Yuri:
    imagebutton:
        xalign 0.5 yalign 0.5 
        

        idle "yuri_a.png"


label start:
    scene bg room
    jump intro
label intro:
        # Show a background. This uses a placeholder by default, but you can
        # add a file (named either "bg room.png" or "bg room.jpg") to the
        # images directory to show it.

        
        # This shows a character sprite. A placeholder is used, but you can
        # replace it by adding a file named "eileen happy.png" to the images
        # directory.

       

        # These display lines of dialogue.

        #จุดเริ่มต้น
#วาดฉาก lobby
        Unknown "ยินดีต้อนรับ ก่อนเริ่มเกมโปรดจำไว้ว่าการออกเกมโดยการกดปิดเกมที่ไม่ใช่วิธีปิดผ่านเมนูเกมอาจจะทำให้ความคืบหน้าหายได้"
        "คุณคือใครเหรอ"
        
        Unknown "ฉันคือผู้ที่บันทึกและจัดการระบบเกม"
        Unknown "ว่าแต่ชื่ออะไรเหรอ ฉันขอชื่อหน่อยนะ \n(ระบบจะบันทึกชื่อคุณ เพื่อที่จะบันทึกประวัติการเล่น)"

        #ใส่ชื่อผู้เล่น
        $ Player = renpy.input("ชื่อของคุณ \nกด Enter เพื่อเริ่ม", length=25)

        Unknown "สวัสดี คุณ[Player] ยินดีต้อนรับ สามารถคลิกเพื่อเริ่มเกมได้เลย ^^"
        jump chapter1
        return
label chapter1 :
    
    # Show a background. This uses a placeholder by default, but you can
    # add a file (named either "bg room.png" or "bg room.jpg") to the
    # images directory to show it.

    scene house
    "ณ เวลา 8.40"
    Player  "อ่า....อากาศดีจัง"
    Player  "หลับเต็มอิ่มนี่มันรู้สึกดีจริงๆ"
    Player   "นานๆทีจะตื่นก่อนได้ยินเสียงปลุกด้วยสิ"
    Player   "เอาล่ะ ต้องเตรียมตัวไปแล้วสิ"

#วาดตอนดูมือถือปิด
    scene phone_c
    Player          "เอ...ทำไมโทรศัพท์มันไม่ปลุกล่ะ มันควรจะต้องดังแล้วล่ะ"
    Player          "ตั้งเวลาไว้ตั้ง 6 รอบแล้วแท้ๆ ไม่ดังแม้แต่ครั้งเดียว"
    scene phone_c_house
    Player          "อย่า..อย่าบอกนะว่าจะเผลอกดปิดอีกแล้ว"
    scene phone_o_house with dissolve
#วาดตอนกดเปิดมือถือ
    "เอ๋!!!!!!!!!!!!!!"
    Player          "นี่...มันสายแล้วนี่หว่า"
    scene fronthouse
    Player          "ต้องรีบแล้วววว"
    Player          "เราชื่อ[Player] เป็นเด็กมหาลัยคนหนึ่งที่ได้รับการให้ทำการทดสอบการคัดเลือกเข้าทำงานของที่นี่"
    Player          "ถึงวันนี้จะไม่ใช่วันคัดเลือกก็เถอะนะ"
    Player          "แต่ก็จะไปสายแต่่วันแรกไม่ได้"
    Player          "แย่แล้ว"
    Player          "แย่แน่เลย"

#วาด / รูปหน้าบริษัท
        #ที่บริษัท
    scene frontco
    "ณ บริษัท"

    Player          "รอดแล้ว"
    Player          "เท่านี้ก็ทันเวลา"
    Player          "แล้วเราจะทำยังไงต่อดีละเนี่ย"
    menu:
               
                "เดินเข้าไปเลย":
                        Player "เออ ว่าแต่ฉันจะต้องไปไหนต่อเนี่ย"
                        Player "ถามพี่พนักงานดีกว่า"
                        Player "รบกวนถามอะไรหน่อยครับ office ไปทางไหนหรือครับ"
                        Mc "ตรงไปแล้วเลียวขวา จากนั้นขึ้นสองเลยค่ะ"


                "โทรศัพท์จากเบอร์เขาให้มา":
                        Player "พี่ ผมจะไปเจอพี่ที่ไหน"
                        Fah "ให้ไปเจอที่ office อยู่ชั้นสองตึกข้างหน้าสุด"

                #คำถาม
#วาด / รูปหน้า office   4
    scene office   
    show screen Fah
    Fah             "สวัสดีน้อง คือคนที่มาฝึกงานที่นี่ใช่ไหมคะ "
    Player          "ผมคือผู้ที่ถูกเลือกให้มาฝึกงานที่นี่"
    Fah             "สวัสดี พี่ชื่อฟ้า จะเป็นคนแนะนำสถานที่นี้ในองค์กรคร่าวๆให้นะ"
    Fah             "ถ้ามีอะไรไม่เข้าใจก็ถามได้เลยนะ"
    Player          "ได้เลย ยินดีที่ได้รู้จัก"
    hide screen Fah
    #--------------------------แนะนำสถานที่
    scene matchroom
#รูปลานจอดรถ
    Fah             "พี่จะแนะนำสถานที่นะคะ เดินตามมาได้เลย"          
    Player          "ขอถามหน่อย\nมาสคอตหน้าทางเข้ามีชื่อเรียกไหม"
#รูปมาสคอต
    Fah "สองตัวนั้นชื่อวานะและนาวะ"
    Fah "วานะหมายถึงป่า \nนาวะหมายถึงน้ำ"

    #รูปจุดวาดตั๋ว
    scene matchroom1
    Fah             "เริ่มแรกจะเป็นจุด Ticketing นะคะ ซึ่งจุดนี้จะต้องซื้อริสแบนด์ที่ใช้เข้าสวนน้ำชื่อว่า RFID ซึ่งริสแบนด์จะสามารถสแกนเพื่อเป็นบัตรผ่านเข้าไปในสวนน้ำ"
    Fah             "นอกจากนี้ยังสามารถเป็นแทนบัตรเช่าล็อกเกอร์และเติมเงินเพื่อซื้อสินค้าภายในสวนน้ำ ตัวอย่างเช่นร้านอาหารต่างๆ"

#รูปรีเทล
    scene matchroom2
    Fah             "ต่อไปจะเป็นร้านขายของวานา นาวา ที่นี่จะขายของที่ระลึก เช่น ตุ๊กตาน้องวานะและนาวะ  ชุดว่ายน้ำ ครีมกันแดด"

#รูปวานา วันเดอร์แลนด์
    scene matchroom3
    Fah             "เมื่อเดินออกมาจะเจอเครื่องเล่นสำหรับเด็ก เครื่องเล่นนี้ชื่อว่าวานา วันเดอร์แลนด์มีพื้นที่ถึง 550 ตารางเมตร ประกอบด้วยเครื่องเล่นสำหรับเด็กหลาดหลายสีสัน สำหรับที่นี่ผู้เล่นจะต้องมีความสูงไม่ต่ำกว่า 90 เซนติเมตรและไม่เกิน 140 เซนติเมตร"
#รูปเดอะโกรฟ
    scene matchroom3_1
    Fah             "เมื่อเดินกลับมาจะเจอศูนย์อาหาร "
    scene matchroom4
    Fah             "ที่นี่มีชื่อว่าเดอะโกรฟ ที่นี่จะขายอาหารนานาชาติ เช่น \nเวสเทิร์นคอร์เนอร์-มุมอาหารตะวันตก \nช้อปสติ๊กส์-มุมอาหารจีน \nนู้ดเดิ้ลบาร์-มุมอาหารเส้น \nไทยไรซ์” มุมอาหารไทย \nและ ซีฟู๊ดกริลล์-มุมอาหารซีฟู๊ด"
    Fah             "ที่นี่สามารถจ่ายได้ผ่าน RFID จากริสแบนด์"

#รูปล็อกเกอร์
    scene matchroom4_1
    Fah             "เมื่อเดินออกจากเดอะโกรฟ"
    scene matchroom5
    Fah             "จะเจอชั้นใต้ดินจะเจอตู้ล็อกเกอร์ ที่นี่สามารถเปิดได้ด้วย RFID"

#รูปเครื่องเล่นไต่เชือก
    scene matchroom5_1
    Fah             "ข้างหน้าจะเป็นกิจกรรมที่เกียวกับ Activity และยังเป็นสองกิจกรรมที่จำเป็นต้องสวมรองเท้าหุ้มส้นพร้อมทั้งอุปกรณ์ช่วยเหลือ"

#รูปโรพส์คอร์ส+วิธีการเล่น
    scene matchroom7
    Fah             "ฝั่งซ้ายจะเป็นที่ชื่อว่าโรพส์คอร์ส () เป้าหมายของเครื่องเล่นนี้คือไต่เชือกจนไปถึงจุดบนสุดให้ได้ซึ่งสูงถึง 13.4 เมตร" 
    Fah             "โดยผู้เล่นจะต้องมีส่วนสูงเกิน 122 เซนติเมตร \n น้ำหนักมากกว่า 136 เซนติเมตร \n และสวมรองเท้าหุ้มส้น"
    Fah             "โดยผู้เล่นจะต้องเชื่อฟังพี่ๆพนักงานอย่างเคร่งครัด"
#รูปหน้าผมจำลอง+วิธีการเล่น
    scene matchroom8
    Fah             "ฝั่งขวาจะชื่อหน้าผาจำลองที่มีความสูงถึง 12.2 เมตร ผู้เล่นจะต้องสูงมากกว่า 150 เซนติเมตร"
    Fah             "โดยผู้เล่นจะต้องเชื่อฟังพี่ๆพนักงานอย่างเคร่งครัดเช่นเดียวกัน"

# #รูปริพเคิร์ล เซิร์ฟช้อป
#     Fah             "เมื่อเดินต่อจะเจอร้านเสื้อผ้า ริพเคิร์ล เซิร์ฟช้อป เป็นร้านขายสินค้าแบรนด์แฟชั่นชั้นนำระดับโลกผู้จัดจำหน่ายผลิตภัณฑ์เสื้อผ้า อุปกรณ์และเครื่องประดับสำหรับกีฬาประเภทเซิร์ฟ"

# #รูปช้างเซิร์ฟโซน
#     Fah             "ข้างๆชื่อว่า flow ridder บริเวณด้านข้างๆ ริพเคิร์ล เซิร์ฟช้อป สถานที่โต้คลื่นจำลอง สามารถรอบรับผู้เล่นเล่นมากถึงสองคนพร้อมกันได้ ซึ่งผู้เล่นต้องเช็นเอกสารยินยอมเพราะเครื่องเล่นมีความอันตรายเป็นอย่างมาก()"

#รูปแผนกนวด
    scene matchroom8_1
    Fah             "เมื่อออกจากบริเวณ ช้างเชริพโซน"
    scene matchroom9
    Fah             "จะเห็นร้านนวดแผนของวานา นาวา ข้างๆใต้สไลค์เดอร์บูมเบอร์แรงโก้" 
    Player          "บูมเมอร์แรงโก้คืออะไร?"
    Fah             "บูมเมอร์แรงโก้คือเครื่องเล่นสีเหลืองดำที่ช้างหน้านั้นไง"

#รูปวานาดิโอ
    scene matchroom10
    Fah             "ตรงนี้จะเป็นสตูดิโอใต้น้ำ ชื่อว่าวานาดิโอ เป็นสถานที่รูปใต้น้ำมีความลึกถึง xx เมตร มีอุปกรณ์ครบครัน มีให้เลือกบรรยากาศถึง 10 แบบ"

#รูปโคโคนัทบีช
    scene matchroom10_1
    Fah             "ตรงนี้จะชื่อว่าโคโคนัทบีชหรือเวฟพูลเป็นทะเลจำลองมีพื้นที่มากถึง 1,600 ตารางเมตร ลึกสูงสุดถึง 183 เซนติเมตร ทรายของที่นี่เป็นทรายจริงอีกด้วย"
    scene matchroom11
    Fah             "รอบๆนี้จะมีที่นั้งหลังศาลาคอยให้บริการ ชื่อว่าคาบาน่าและบีชฮัท ในส่วนที่เป็นศาลาบีชฮัทจะมีสำหรับการพักผ่อนในพื้นที่ส่วนตัว พร้อมติดตั้งพัดลมเพดานเพิ่มความเย็นสบาย\nสามารถติดต่อได้ที่ฟิชเชอร์แมนส์คาเฟ่"

#รูปเลซี่ริเวอร์
    scene matchroom11_1
    Fah             "ที่เห็นสระว่ายน้ำเป็นลักษณะคล้ายๆแม่น้ำมีชื่อว่าเลซี่ริเวอร์มีความยาวกว่า 345 เมตร มีความลึก 90 เซนติเมตร"

#รูปโรงแรม ทางเข้าสวนน้ำ
    scene matchroom12
    Fah             "เส้นทางนี้จะนำทางไปสู่โรงแรม Holiday inn เส้นทางนี้จะมีล็อกเกอร์และเป็นจุดเข้าออกของลูกค้าโรงแรม โดยริสแบนด์ที่ใช้เข้าสวนน้ำจะเป็นของโรงแรมโดยเฉพาะ"

#รูปฟิชเชอร์แมนส์คาเฟ่
    scene matchroom12_1
    Fah             "เมื่อข้ามสะพานมา"
    scene matchroom14
    Fah             "จะเจอร้านอาหารชื่อว่าฟิชเชอร์แมนส์คาเฟ่จะให้บริการอาหารและของว่างที่ทานสะดวกและรวดเร็ว"

#รูปอควาคอร์ส
    scene matchroom13
    Fah             "ทางซ้ายจะเจอเครื่องเล่นชื่ออควาคอร์ส เป็นเครื่องเล่นแห่งแรกของประเทศไทยที่ให้คุณสามารถตอบโต้กับผู้เล่นคนอื่นได้"
    Fah             "ทดสอบทักษะการทรงตัวบนเส้นทางแห่งการผจญภัย ท้าทายด้วยสิ่งกีดขวาง และปืนฉีดน้ำที่ยิงโต้ตอบกับผู้เล่น"
    Fah             "ผู้เล่นจะต้องสูง 122 เซนติเมตรขึ้นไปและน้ำหนักไม่เกิน 136 กิโลกรัม"

#รูปเรนฟอร์เทรส
    scene matchroom15
    Fah             "ทางขวาจะมีเครื่องเล่นชื่อเรนฟอร์เทรสเป็นเครื่องเล่นที่รวมความสนุกของเด็กๆที่รวม 7 สไลด์เข้าไว้ด้วยกันและมีถังน้ำขนาดยักษ์ที่ค่อยเทน้ำสาดลงมาโดยจะสาดน้ำลงมาทุกๆ 5 นาที"
    Fah             "จะต้องมีส่วนสูง 91.4 - 122 เซนติเมตรขึ้นไป และน้ำหนักไม่เกิน 136 กิโลกรัมขึ้นไป"

#รูปวานา เคฟ คาเฟ่
    scene matchroom17
    Fah             "ในส่วนของตรงถ้ำนี้จะชื่อว่าวานา เคฟ คาเฟ่ หลังจากที่สามารถมานั่งพักหลังจากสนุกไปกับเครื่องเล่นภายในสวนน้ำ อีกทั้งยังมีร้านอาหาร-เครื่องดื่มอีกมากมายไว้คอยให้บริการ และพิเศษสุดกับเครื่องดื่มซิกเนเจอร์สุดชิคจากบาร์คาดี้"
#รูปคิดดี้โคฟ
    scene matchroom16
    Fah             "ข้างๆจะมีเครื่องเล่นชื่อว่าคิดดี้โคฟสระว่ายน้ำสำหรับเด็กที่มีน้ำพุ เครื่องเล่น และสไลเดอร์สำหรับเด็ก"

#รูปฟิชเชอร์แมนส์ทาเวิร์น
    scene matchroom19
    Fah             "ตรงบาร์ตรงนั้นจะเรียกว่าฟิชเชอร์แมนส์ทาเวิร์น ผ่อนคลายพร้อมไปกับเครื่องดื่มเย็นๆ และสัมผัสกับบรรยากาศของวานา นาวา ฟอลส์ ได้ที่ฟิชเชอร์แมนส์ทาเวิร์น ในสระอินฟินิตี้"

#ภาพ 2 tower
    scene matchroom_1
    Fah             "เราจะมาต่อสำหรับเครื่องเล่นสไลด์ในแต่ละ tower "
    scene matchroomb_1
    Fah             "เราจะมาเริ่ม Tower นี้ก่อน Tower นี้เรียกว่า Tower B ประกอบด้วย 2 เครื่องเล่นคือ"
#รูปอะบิส
    scene matchroombabyss
    Fah             "หนึ่ง อะบิส เครื่องเล่นสีเขียวสไลเดอร์ขนาดใหญ่ที่สุดในประเทศไทย เล่นสูงสุด 6 คนต่อครั้ง ด้วยความเร็วสูงถึง 45 กิโลเมตรต่อชั่วโมง\nตัวผู้เล่นต้องมีส่วนสูงมากกว่า 137 กิโลเมตร น้ำหนักทั้งกลุ่มต้องมากกว่า 200 กิโลกรัม และมีอายุมากกว่า 12 ปี"
#รูปบูมเบอร์แรงโก้
    scene matchroombboomerango
    Fah             "สอง บูมเมอร์แรงโก้ มีสีเหลืองเป็นสไลเดอร์ที่ยาวที่สุดในประเทศไทย เล่นสูงสุด 6 คนต่อครั้ง ด้วยความเร็วสูงถึง 45 กิโลเมตรต่อชั่วโมง\nตัวผู้เล่นต้องมีส่วนสูงมากกว่า 122 กิโลเมตร น้ำหนักทั้งกลุ่มต้องมากกว่า 200 กิโลกรัม "
#รูปแผนที่ T A
    scene matchrooma1f
    Fah             "ต่อมา Tower นี้จะเรียก Tower A จะมี 5 เครื่องเล่น"
    Fah             "ชั้นแรกจะมี 4 เครื่องเล่น"
#รูปซุปเปอร์โบวล์
    scene matchroomasuper
    Fah             "เครื่องเล่นแรกคือ ซุปเปอร์โบวล์ สไลด์ดิ่งไต่ขอบไหลวนลงสู่ชามยักษ์สู่สระน้ำเบื้องล่าง ด้วยความเร็ว 18-50 กม./ชม ผู้เล่นจะต้องมีส่วนสูงมากกว่า 122 เซนติเมตร"
#รูปมาสเตอร์บลาสเตอร์
    scene matchroomamaster
    Fah             "มาสเตอร์บลาสเตอร์ เป็นสไลค์สีเหลืองเคลื่องที่ด้วยความเร็ว 45 กิโลเมตรต่อชั่วโมง เป็นสไลค์ที่มีเทคโนโลยีจำลองภาพเสมือนจริงแบบ 360 องศา จากสหรัฐอเมริกา\nมีให้เลือก 3 แบบ\nผู้เล่นจะต้องมีส่วนสูงมากกว่า 122 เซนติเมตร"
#รูปแรทเลอร์
    scene matchroomarattler
    Fah             "แรทเลอร์ เครื่องเล่นที่ไหลไปตามท่อ จากความสูงกว่า 13 เมตรด้วยความเร็วมากกว่า 25 กิโลเมตรต่อชั่วโมง ผู้เล่นจะต้องมีส่วนสูงมากกว่า 122 เซนติเมตร"
#รูปอินเนอร์ทูป 
    scene matchroomainner
    Fah             "อินเนอร์ทูป เครื่องเล่นสีส้ม เคลื่อนที่ความเร็วมากกว่า 25 กิโลเมตรต่อชั่วโมงผู้เล่นจะต้องมีส่วนสูงมากกว่า 122 เซนติเมตร"
#รูปแผนที่ชั้นสอง
    scene matchrooma2f
    Fah             "ชั้นสองจะมีเครื่องเล่นสองตัวคือ"
#รูปฟรีฟอลล์
    scene matchroomafreefall
    Fah             "ฟรีฟอลล์ เป็นสไลด์ดิ่งด้วยความเร็วสูง ด้วยความเร็วมากกว่า 50 กิโลเมตรต่อชั่วโมง\nผู้เล่นจะต้องมีส่วนสูงมากกว่า 122 เซนติเมตร และน้ำหนักไม่เกิน 136.4 กิโลกรัม"
#รูปอควาลูป
    scene matchroomaaqualoop
    Fah             "และเครื่องเล่นสุดท้าย อควาลูป สไลด์แห่งแรกของประเทศไทยที่มีสไลด์เหวี่ยงหมุน 360 องศา ด้วยความเร็วสูงสุดมากกว่า 60 กิโลเมตรต่อชั่วโมง\nผู้เล่นจะต้องมีส่วนสูงมากกว่า 122 เซนติเมตร และน้ำหนักไม่เกิน 136.4 กิโลกรัม"
    scene office
    show screen Fah
    Fah             "สำหรับการแนะนำสถานที่คร่าวๆเสร็จเป็นที่เรียบร้อยที่อะไรสอบถามไหมค่ะ"

                        # 1.เครื่องเล่นสำหรับเด็ก
                        # 2.tower A มีอะไรบ้าง
                        # 3.ร้านอาหารทั้งหมด
                        # 4.บริการในสวนน้ำ ล็อกเกอร์ ขายตั๋ว
                        # 5.ประวัติของสวนน้ำ

    Fah             "สำหรับการฝึกงานของเทอมนี้จะมีระยะเวลา 4 เดือน "
    Fah             "หลังฝึกเสร็จจะมีการทดสอบเพื่อทำการคัดเลือกเข้าฝึกงาน ขอให้โชคดีค่ะ"
    hide screen Fah
    scene computer
    Player          "วันแรกเหนื่อยจัง เอาจริงการทำงานที่นี่ก็เหมือนๆหลายๆที่นะ ไม่ได้ยากอย่างที่คิด"
    scene computer2
    show screen Bell
    Bell            "นี่ๆ "
    scene computer
    Player          "เอ๋"
    scene office
    Bell            "เป็นอะไรหรือดู หน้าตาดูเครียดเลย"
    Player          "อ้อๆเปล่าเลยๆ สบายดีๆ มีอะไรหรอก"
    Player          "เอ๊ะ เบลเหรอ"
    Bell            "เอ นี่นายคือ[Player]ใช่ไหม ที่เรียนตอน ม.ปลายที่เดียวกัน"
    scene officeb with dissolve
    "(แย่แล้วดันมาเจอมาตอนนี้ ถ้าเป็นคู่แข่งละก็ แย่แน่เลย)"
    scene office
    Bell            "ว่าไง...เป็นไงบ้าง ไม่ได้เจอกันนานเลยนะ ^^"
    Player          "เออ คือ ก็สบายดีนะ แล้วเธอละ"
    Bell            "ก็สบายดี ฉันก็เริ่มฝึกงานเหมือนกับนายเลย"
    Player          "นี่เบล เสร็จจากนี่ไปกินข้าวด้วยกันไหมมีเรื่องให้คุยกันเยอะเลย"
    "ฮิ ต้องรีบตัดบทสนทนาก่อนที่เธอจะพูดอะไรออกมา"
    Bell            "เบล ก็ได้นะ"
    "เย้ สำเร็จ ชวนสำเร็จแล้ว"
    Player          "โอเค แล้วเราจะรอนะ"
    hide screen Bell
    show screen Fah
    #ตัวละครฟ้าด้านข้าง
    Fah             "นั้นแฟนเก่าเหรอจ๊ะ"
    Player          "จะเป็นไปได้ยังไงละครับ"
    Player          "คือว่าพวกเราเรียนที่เดียวกันตอนมัธยมต้นและปลายกัน"
    Fah             "บังเอิญจังนะ"
    "ผมได้มองหน้าเบล"
    Player          "แล้วเบลมีอะไรหรืออะไรหรือเปล่า"
    hide screen Fah
    show screen Bell
    Bell            "อ้อใช่ เกิอบ ลืมเลยนี่ค่ะงานอาร์ตที่พี่ฟ้าได้สั่งไว้คะ"
    hide screen Bell

    
    #รูปวาดเบล
    "เมื่อเบลได้ให้งานให้ผมกับพี่ฟ้าดู ผมก็ได้เห็นความสามารถที่ของเบล ซึ่งมันเป็นงานที่ดีกว่าคนทั่วไปมาก"
    "เพราะงานดีมากๆ ไม่นึกว่าแค่ไม่เจอกัน 3-4 ปี จะเปลียนไปขนาดนี้"

    menu :
                "ว้าว เบลนี้เปลี่ยนไปเยอะเลยนะ":
                        Bell  "อ่า ขอบคุณมากๆนะ ที่ผ่านมาเบลได้ไปฝึกอย่างหนักหน่วง "
                        Fah   "งานดีมากๆเลยละ ขอบใจมากนะ"
                        Bell  "ขอบคุณค่ะ งั้นเบลไปก่อน"
                        Bell  "เจอกันที่ร้านอาหารหลังเลิกงานนะ"
                        $ B_Relation = B_Relation + 1

                "ผลงานเธอยังเหมือนเดิมฮะ":
                        Bell "ว่าไงนะ เราฝึกมาตั้งนานนะ"
                        Fah   "โอเคเลย ขอบใจมากๆเลยนะ"
                        Bell  "งั้นเจอกันตอนร้านอาหารแล้วกัน"
                        $ B_Relation = B_Relation -1
    
    #ฉากร้านอาหาร
    scene restaurant
        #ที่ร้านอาหาร
    Player          "ใครมันจะไปคิดว่าจะมาเจอเธอที่นี่ละ"
#ฉากในร้านอาหาร+เบล
    Bell            "นั้นสินะ บังเอิญจัง แล้วนายเป็นยังไงบ้างที่ผ่านมา"
                #คำถาม
    menu :
        "ก็เหนื่อยอยู่นะ เจอเรื่องอะไรหลายๆอย่างเลยกว่าจะถึงจุดนี้":
                Bell "เหมือนกันเลย เราคิดว่าสกิลเราเยอะกว่าแต่ก่อนมากเลย 555"
                Bell "เออ...ใช่"
                $ B_Relation = B_Relation + 1
                
        "สบายๆอยู่แล้ว ระดับเราแล้ว":
                Bell "จริงสิ อย่างนายเก่งอยู่แล้วละ ระดับนายละนะ"
                $ B_Relation = B_Relation - 0
        "ยุ่งเรื่องคนอื่นจังน้า เธอเนี่ย":
                Bell "กวนประสาทเก่งไม่เปลียนนะนายเนี่ย"
                Player "แฮะ โทษทีๆนะ"
                Bell "หึ เออ...ใช่"
                $ B_Relation = B_Relation -1

    #ทำเป็นรูปนึก
    Bell            "นายรู้ไหม กายที่นายชอบแข่งสร้างกันผลงานกันประจำก็มาแข่งเหมือนกันนะ"
    Player          "หืม จริงเหรอ หมอนั้นไม่รู้ตอนนี้เก่งขนาดไหนแล้วนี่สิ"
    Bell            "แต่ก็คงไม่เก่งไปกว่านายหรอก 555"
    Player          "ถ้าเป็นอย่างนั้นก็ดีสินะ"

    jump chapter2_1
    return

label chapter2_1 :

#วาดฉากห้องแข่ง
        scene matchroom
        #การทดสอบครั้งที่ 1
        Yuri            "เอาละคะ ขอแนะนำก่อนนะคะ พี่ชื่อยูริ พี่จะมาแนะนำวิธีการแข่งขันนะค่ะ"
        Yuri            "เริ่มแรกจากผู้เข้าคัดเลือก 15 คน จะมีผู้เข้าผ่านการเข้าเลือก 2 คน ที่นอกจากจบการฝึกงานแล้วยังได้มีโอกาสเข้ารับการทำงาน"
        Yuri            "เริ่มแรกเกมนี้จะมีคะแนนเต็ม 100 คะแนน ให้ผู้เข้าแข่งขันตอบภาพปริศนาที่อยู่หลังจิ๊กซอว์ 25 ช่อง โดยผู้เข้าแข่งขันจะมีสิทธิ์เปิดได้ 1 ช่อง หากตอบถูกจะได้คะแนนเต็ม 25 คะแนน แต่ถ้าหากผู้เข้าแข่งขันไม่แน่ใจในคำตอบ สามารถ เปิดเพิ่ม ได้ครั้งละ 1 ช่อง แต่คะแนนจะลดลงครั้งละ 5 คะแนน หากตอบถูกจะได้คะแนนในขณะนั้น แต่ถ้าหากตอบผิดจะได้ 0 คะแนนทันทีในข้อนั้น"
        Yuri            "ตัวภาพที่ทายจะสุ่มมา 5  ภาพไม่ซ้ำกัน"

        Npc             "แล้วในกรณีที่คะแนนเท่ากันละครับ"
        Yuri            "สำหรับในกรณีที่ตะแนนเท่ากัน จะมีรอบตอบคำถามพิเศษค่ะ"
        Yuri            "สำหรับในรอบนี้ ผู้เข้าแข่งขันจะต้องแข่งกันทายสถานที่ จากข้อความที่ถูกปิดไว้"
        Yuri            "ในรอบที่สอง จะเป็นด่านตอบคำถาม ในด่านตอบคำถามจะมีมินิเกมซ่อนไว้ เกมจะนำผู้เล่นเดินไปคามช่อง ถ้าตอบถูกจะเดินไปทอยลูกเต๋าซค่งจะเดินได้สูงสุด 6 ช่อง แต่ถ้าตอบผิดจะสุ่มลูกเต๋าเหมือนกัน แต่สุ่มได้สูงสุดคือ 1 - 3 แต้ม"
        Yuri            "ในสำหรับวันนี้วันแรกจะเป็นการแข่งด่านแรก เริ่มได้ ขอให้โชคดี"
        
                        # 1.เครื่องเล่น tower A มีอะไรบ้าง
                        # 2.เครื่องเล่น tower B มีอะไรบ้าง
                        # 3.ข้อปฏิบัติของการเครื่องเล่น abyss และบูมเบอร์แรงโก้
                        # 4.ข้อปฏิบัติของการเครื่องเล่นของเครื่องเล่น freefall และ aqueloop
                        # 5.ประเภทของห่วงยางมีอะไร มีชื่อเรียกว่าไร
                        # 6.เครื่องเล่นที่ใช้ห่วงยาง tube มีอะไรบ้าง
                        # 7.มาร์เตอร์มี vr slider มีกี่รูปแบบ
                        # 8.เครื่องเล่นที่ไม่สัมผัสกับน้ำ
                        # 9.ในเคพมีร้านอาหารอะไรบ้าง
                        # 10.สไลเดอร์ของวานา นาวาคือเครื่องเล่นอะไร
                        # 11.เครื่องเล่นที่มีความเร็วสูงที่สุดคือเครื่องเล่นอะไร
                        # 12.เดอะโกรฟมีอาหารประเภทใดบ้าง
                        # 13.คาบาร่าวาน่าและบีตฮัทแตกต่างกันอย่างไร
        jump game_1                
label chapter2_1_1:

        Yuri            "สำหรับการแข่งวันนี้ก็เสร็จสิ้นแล้ว ขอบคุณทุกคนมากค่ะ"
        Yuri            "สำหรับผลการแข่งขันโปรดดูในเมล์ของผู้เข้าแข่งขันได้เลยค่ะ"
#วาดมุมเห็นกางเกงเกม + ส่งเสียง
        #หน้าประกาศผล
        $ NPC1_Score = renpy.random.randint(1, 20)
        $ NPC2_Score = renpy.random.randint(1, 20)
        $ NPC3_Score = renpy.random.randint(1, 20)
        $ NPC4_Score = renpy.random.randint(1, 20)
        $ NPC5_Score = renpy.random.randint(1, 20)
        $ NPC6_Score = renpy.random.randint(1, 20)
        $ NPC7_Score = renpy.random.randint(1, 20)
        $ NPC8_Score = renpy.random.randint(1, 20)
        $ NPC9_Score = renpy.random.randint(1, 20)
        $ NPC10_Score = renpy.random.randint(1, 20)
        $ NPC11_Score = renpy.random.randint(1, 20)
        $ NPC12_Score = renpy.random.randint(1, 20)
        $ Bell_Score1 = renpy.random.randint(1, 20)
        $ Kai_Score1 = renpy.random.randint(1, 20)
        if B_Relation >= 0:
            jump chapter2_2
        elif B_Relation < 0:
            jump chapter2_3
        
        return

label chapter2_2 :
#รูปร้านอาหาร
        scene restaurant
        Bell            "วันแรกเป็นไงบ้างละ"
        Player          "อืม..ก็ยากอยู่นะ วันนี้"
        Bell            "วันนี้เขาจะประกาศผลใช่ไหมคืนนี้"
        menu :
                "ใช่แล้ว รอดูประกาศคืนนี้ได้เลย" :
                        Bell "ได้เลยๆ แล้วเราจะรอดู"
                        Player "นี้น่าจะใกล้ประกาศผลแล้วนะ"
                        
                "เดียวเขาก็ประกาศบอกเองแหละ":
                        Bell "แล้วเราจะรู้ไหมเนี่ย ตอบแบบนี้...."
                        Bell "เออๆ ช่างเถอะ"
                        $ B_Relation = B_Relation - 1
      
        "เสียง discord"
        Player          "ทาง บ. เขาได้ส่งคู่มาแล้ว"
        Bell            "นายคิดว่านายจะได้คู่แบบไหน"
        Player          "ก็คงได้คนทั่วไป คงไม่ได้คนเก่งหรอก"

        Bell            "นายคิดว่าคู่ของนายจะเป็นคนแบบไหนเหรอ"
        Player          "ก็น่าจะเป็นจะเป็นธรรมดาทั่วไปละ คงไม่ได้เป็นคนเก่งอะไรหรอก"
        Bell            "ก็อยู่ที่ดวงแล้วอะนะ ^^"
        Player          "ไม่จริงน่า ฉันกับเธอเนี่ยนะ บังเอิญไปป่าว"
        Bell            "นั้นสินะ บังเอิญจังแต่ก็ดีแล้วละ"
        Player          "นั้นเรามาคุยกันพรุ่งนี้กันดีกว่า คำถามพรุ่งนี้เกียวกับอะไรนะ"
        Bell            "เหมือนจะเป็นเกี่ยวกับพวกสถานที่ภายในสวนน้ำนะ ถ้าเราจำได้ก็คงไม่ยากหรอก"
        jump chapter3
#วาดหนังสือ img maping
        return

label chapter2_3 : 
#รูปร้านอาหาร
        scene restaurant
                #ร้านอาหาร
        Bell            "เป็นไงบ้างละวันนี้"      
        Player          "เฮ้อออ ยากอยู่ แต่ก็ผ่านมาได้ "
                #คำถาม
        menu:
                "แล้วเขาจะประกาศคู่ตอนไหนเหรอ":
                        Bell "คืนนี้ละ อย่าเครียดเลย ทำให้ดีที่สุดก็พอแล้ว"
                        $ B_Relation = B_Relation -0
                "พูดถึง นายอยากคู่กับฉันไหม":
                        Bell "ก็ได้นะ นายเองเก่งเหมือนกันนี่ ><"
                        Player "แล้วเขาจะประกาศคู่ตอนไหนเหรอ"
                        Bell "คืนนี้ละ อย่าเครียดเลย ทำให้ดีที่สุดก็พอแล้ว"
                        $ B_Relation = B_Relation + 1
        
      
        "เสียง discord"

        Player          "เอ๊ะ เสียงแจ้งเตือน"
        Player          "ทาง บ. เขาได้ส่งผลมาแล้ว"
        Bell            "นายคิดว่าคู่ของนายจะเป็นคนแบบไหนเหรอ"
        Player          "ก็น่าจะเป็นจะเป็นธรรมดาทั่วไปละ คงไม่ได้เป็นคนเก่งอะไรหรอก"
        Bell            "ก็อยู่ที่ดวงแล้วอะนะ ^^"
        Bell            "เอ๋...นายกับฉันอยู่ทีมเดียวกันละ"
        Player          "ไม่จริงน่า ฉันกับเธอเนี่ยนะ บังเอิญไปป่าว"
        Bell            "นั้นสินะ บังเอิญจังแต่ก็ดีแล้วล่ะ"
        Player          "นั้นเรามาคุยกันพรุ่งนี้กันดีกว่า คำถามพรุ่งนี้เกียวกับอะไรนะ"
        Bell            "เหมือนจะเป็นเกียวกับพวกสถานที่ภายในสวนน้ำนะ ถ้าเราจำได้ก็คงไม่อยากหรอก"
        Bell            "เรามีหนังสือรวมข้อมูลสถานที่ด้วย อยากรู้ตรงไหนเป็นพิเศษไหม"
        Bell            "อ่าฮะ"
#วาดหนังสือ img maping
        jump chapter3
        return


label chapter3:
        scene matchroom
#วาดฉากห้องแข่ง
        #การทดสอบครั้งที่ 2
        "การทดสอบครั้งที่ 2"
        "มาถึง บ. ซะที"
#ตัวละครกาย

        Kai             "เป็นไงบ้างละ ได้ข่าวว่านายได้คะแนนน้อยจนผ่านแบบเกือบไม่รอด"
                #คำถาม
        menu : 
                "เราพลาดหลายข้อไปหน่อย":
                        Kai "ระวังคะแนนนายจะถูกเรานำนะ 555 "
                        Kai "แค่ตอนนี้คะแนนเรายังมากกว่านายเยอะ"
                        $ K_Relation = K_Relation - 1
                "เราพลาดแค่ครั้งนี้ละ ครั้งต่อไปคะแนนเราก็นำนายอยู่ดี":
                        Kai "แล้วเราจะเคยดูละ แค่ตอนนี้คะแนนเรายังกว่านาย"
                        $ K_Relation = K_Relation - 2
        
        Yuri            "เอาละคะๆ ก่อนอื่นก็ขอต้อนรับและยินดีทุนคนที่ผ่านเข้ารอบนะค่ะ ยินดีด้วย เย้"
        Npc             "เย้....."
        Yuri            "ก่อนอื่นขออธิบายด่านนี้ซ้ำอีกรอบนะคะ"
        Yuri            "การทดสอบรอบที่ 2 "
        Yuri            "กติกาก็คือผู้เข้าแข่งขันจะต้องตอบคำถามจากคำถามที่เจอ"
        Yuri            "หากตอบถูกจะสุ่มการเดินโดยอ้างอิงจากกาารสุ่มลูกเต๋ามากถึง 6 ช่อง หากตอบผิดจะสุ่มได้มมากสุ่ม 3 ช่อง"
        Yuri            "ในนั้นจะมีมินิเกม 2 เกมคือเกมหาของ และ เกมทำอาหาร"


        jump game_2
label chapter3_0:
    
        Yuri            "สำหรับการแข่งขันวันนี้ก็จบลงแล้ว ขอบคุณทุกคนมาก"
        if B_Relation >=3 :
            jump chapter4_1
        elif B_Relation >=1 and B_Relation <=2  :
            jump chapter4_2
        else:
            jump chapter4_3
        
        return


label chapter4_1 :
#ฉากร้านอาหาร
        #ตอนจบ
        Bell            "นี่ๆหนึ่ง ทาง บ. เขาส่งคะแนนมาแล้วละ"
        Player          "แล้ว คะแนนของพวกเราเป็นยังไงบ้างละ"
        Bell            "ทีมเราผ่านการคัดเลือกได้คะแนนรวมทั้งสิ้น"
        Player          "เอ๋....มีโทรศัพท์เข้า"
        Player          "สวัสดีครับ นี่ [player]"
        Fah             "ยินดีด้วยนะพวกเธอ หวังว่าพวกเธอจะเป็นเพื่อนร่วมงานที่ดีนะ"
        Bell            "ได้เลยค่ะ ขอบคุณมากเลยนะคะ"
        jump ending
        return
label chapter4_2 :
#ฉากร้านอาหาร
        #ตอนจบ
        Bell            "นี่ๆ[player] ทาง บ. เขาส่งคะแนนมาแล้วละ"
        Player          "แล้ว คะแนนของพวกเราเป็นยังไงบ้างละ"
        Bell            "ทีมเราผ่านการคัดเลือกได้คะแนนรวมทั้งสิ้น"
        Player          "เอ๋....มีโทรศัพท์เข้า"
        Player          "สวัสดี นี้[player]ครับ"
        Fah             "ยินดีด้วยนะพวกเธอ หวังว่าพวกเธอจะเป็นเพื่อนร่วมงานที่ดีนะ"
        Bell            "ขอบคุณนะคะ"
        jump ending
        return
label chapter4_3 :
#ฉากร้านอาหาร
        #ตอนจบ
        Bell            "นี่ๆ[player] ทาง บ. เขาส่งคะแนนมาแล้วละ"
        Player          "แล้ว คะแนนของพวกเราเป็นยังไงบ้างละ"
        Bell            "ทีมเราผ่านการคัดเลือกได้คะแนนรวมทั้งสิ้น"
        Player          "เอ๋....มีโทรศัพท์เข้า"
        Player          "สวัสดี นี้[player]ครับ"
        Fah             "ยินดีด้วยนะพวกเธอ หวังว่าพวกเธอจะเป็นเพื่อนร่วมงานที่ดีนะ"
        Bell            "ก็หวังว่านะ....."
        jump ending
        return

label fail_waiting :
        return

label fail_1 :          #ถ้าตกรอบครั้งที่ 1
#วาดฉาก lobby
        Unknown         "อืม นายตกรอบเหรอ ฉันจะให้โอกาสนายอีกครั้ง ฉันจะทำการย้อนเวลาให้นายไปตอนคืนก่อนวันทดสอบ"
        "......ย้อนกลับไปคืนที่แล้ว......"
        return



label ending_fail :          #แพ้เกม
#วาดฉาก lobby
        Unknown         "ฉันให้โอกาศนายแล้ว แต่นายกลับแพ้ได้ยังไง"
        Unknown         "มันจบละ เจอกันใหม่ครั้งหน้า ขอให้เตรียมให้ดีนะ"
        ".............."
        return

label ending :
#วาดฉาก lobby
        #สรุปคะแนน
        Unknown "เอาละ ยินดีต้อนรับกลับนะ  ยินดีด้วยพวกนายเอาชนะเกมนี้ได้"
        Unknown "นี่คือสรุปคะแนนก็คือพวกนายทำได้"
        Unknown "สุดท้ายนี้ก่อนลาจากกัน ขอบคุณที่เล่นมาถึงตรงนี้นะ @Chicken killer "
        return